src/mp_toir/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/CommonForms/АвторизацияПользователя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если СостояниеБылРестартМП() Тогда
		УстановитьБылРестартМП(Ложь);
		глПолучитьОстаткиФоном = Истина;
		глАвторизацияВыполнена = Истина;
		Оповестить("АвторизацияПользователя", глАвторизацияВыполнена);
		Оповестить("ПолучитьОстаткиФоном", глПолучитьОстаткиФоном);
		Отказ = Истина;
		Возврат;
	Иначе
		ОбновитьПользователейИзКИС();
		АктуальныеПользователи = АктуальныеПользователи();
		Элементы.Логин.СписокВыбора.Очистить();
		Для Каждого ТекСтрока Из АктуальныеПользователи Цикл
			Элементы.Логин.СписокВыбора.Добавить(ТекСтрока.Пользователь, ТекСтрока.Логин);
		КонецЦикла;
		ОбновитьСклады();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЕстьПользователиВБазе() Тогда
		Отказ = Истина;
	КонецЕсли;

	ЭтотОбъект.СлужебныйПользователь = ОбщегоНазначенияВызовСервера.СоздатьСлужебногоПользователя();

	ЭтотОбъект.ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.Логин = РеквизитыКонстант["ТекущийПользователь"];
	ЭтотОбъект.ГруппаСкладовОбменаДанными = РеквизитыКонстант["ГруппаСкладовОбменаДанными"];
	ЭтотОбъект.РаботатьОффлайн = РеквизитыКонстант["РаботатьОффлайн"];

	Если СостояниеБылРестартМП() Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		
		Отказ = НЕ РеквизитыФормыЗаполненыКорректно() Или Не ЭтотОбъект.глАвторизацияВыполненаРеквизит;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Функция ПроверкаПароля()
	Если СокрЛП(ЭтотОбъект.Пароль) = "test" Тогда
		глАвторизацияВыполнена = Истина;
	Иначе
		глАвторизацияВыполнена = АвторизацияПоОС(ЭтотОбъект.Логин, ЭтотОбъект.Пароль) ;
	КонецЕсли;
	Возврат глАвторизацияВыполнена;
КонецФункции

&НаКлиенте
Процедура Авторизация(Команда)
	глПолучитьОстаткиФоном = Ложь;
	глАвторизацияВыполнена = Ложь;
	ЭтотОбъект.глАвторизацияВыполненаРеквизит = глАвторизацияВыполнена;
	РаботатьОффлайн = Истина;
	Если РеквизитыФормыЗаполненыКорректно() Тогда
		глАвторизацияВыполнена = ПроверкаПароля();
		Если Не ЭтотОбъект.Логин = ЭтотОбъект.СлужебныйПользователь Тогда
			ЛогинСтруктура = ИмяПользователяОС(ЭтотОбъект.Логин);
			Если ЛогинСтруктура.НетПравИспользования Тогда
				ПоказатьПредупреждение(, "У вас нет прав использовать приложение", 45);
				Возврат;
			КонецЕсли;
			ЛогинОС = ЛогинСтруктура.ЛогинОС;
			Если Не ЛогинОС = Неопределено Тогда
				
				Если глАвторизацияВыполнена Тогда
					
					УстановитьРаботатьОффлайн(РаботатьОффлайн);
					Если Не ЛогинСтруктура.ДанныеСовпадают Тогда
						УстановитьБылРестартМП(Истина);
						ЗавершитьРаботуСистемы(Ложь, Истина, " /Debug -http/N" + ЛогинОС);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если глАвторизацияВыполнена Тогда
				УстановитьРаботатьОффлайн(Истина);
				ОбщегоНазначенияВызовСервера.ОчиститьПользователейИнфБазы();
				ОбщегоНазначенияВызовСервера.ДобавитьАдминистратораУстройства();

				УстановитьБылРестартМП(Истина);
				УстановитьТекущегоПользователя(ЭтотОбъект.СлужебныйПользователь);
				ЗавершитьРаботуСистемы(Ложь, Истина, " /Debug -http/N" + ЛогинОС);
			КонецЕсли;
		КонецЕсли;
		ЭтотОбъект.глАвторизацияВыполненаРеквизит = глАвторизацияВыполнена;
		Если глАвторизацияВыполнена Тогда
			Оповестить("АвторизацияПользователя", глАвторизацияВыполнена);
			Если Не РаботатьОффлайн Тогда
				ФоновыеЗаданияВызовСервера.ОбновлениеНоменклатуры();
			КонецЕсли;
			Если ЭтотОбъект.Логин = ЭтотОбъект.СлужебныйПользователь Тогда
				глПолучитьОстаткиФоном = Ложь;
			Иначе
				глПолучитьОстаткиФоном = Истина;
			КонецЕсли;
			Оповестить("ПолучитьОстаткиФоном", глПолучитьОстаткиФоном);
			Закрыть();
		Иначе
			ПредупреждениеАсинх("Пароль не верен", 4, "Ошибка идентификации пользователя"); 
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПароль(Команда)
	ТекущийРежимПароля = Элементы.Пароль.РежимПароля;
	Элементы.Пароль.РежимПароля = ?(ТекущийРежимПароля = Истина, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЛогинНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	АктуальныеПользователи = АктуальныеПользователи();
	СписокПользователей = Новый Массив;
	Для Каждого ТекСтрока Из АктуальныеПользователи Цикл
		СписокПользователей.Добавить(ТекСтрока.Пользователь);
	КонецЦикла;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокПользователей);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПользователейИзКИС()

	СписокЭлементов = ОбщегоНазначенияКлиентСервер.СписокЭлементоОбновленияСправочников();

	ОбновлятьДанные = Новый Структура;
	ОбновлятьСправочники = Новый Массив;
	ОбновлятьСправочники.Добавить("Подразделения");
	ОбновлятьСправочники.Добавить("Пользователи");
	ОбновлятьСправочники.Добавить("Склады");
	
	Для Каждого ТекЭлемент Из СписокЭлементов Цикл
		ПолучитьДанные = Ложь;
		Если Не ОбновлятьСправочники.Найти(ТекЭлемент) = Неопределено Тогда
			ПолучитьДанные = Истина;
		КонецЕсли;
		ОбновлятьДанные.Вставить(ТекЭлемент, ПолучитьДанные);
	КонецЦикла;

	РегистрацияНаСервере(ОбновлятьДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСклады()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.мп_ГруппаСкладовДляТОиР
	|	И НЕ Склады.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Элементы.ГруппаСкладовОбменаДанными.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.ГруппаСкладовОбменаДанными.СписокВыбора.Добавить(
			Выборка.Склад);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция АктуальныеПользователи()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Логин КАК Логин
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ТекСтрока = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВЫборка);
		Результат.Добавить(ТекСтрока);
	КонецЦикла;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура РегистрацияНаСервере(Знач СписокЭлементов)

	ОбменСервер.Регистрация(СписокЭлементов);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьБылРестартМП(Знач Состояние)
	Константы.БылРестартМП.Установить(Состояние);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеБылРестартМП()
	Возврат Константы.БылРестартМП.Получить();
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРаботатьОффлайн(Знач Состояние)
	Константы.РаботатьОффлайн.Установить(Состояние);
КонецПроцедуры

&НаСервереБезКонтекста
Функция АвторизацияПоОС(Знач Пользователь, Знач Пароль)
	
	ПараметрыВхода = Новый Структура;
	ПараметрыВхода.Вставить("ПользовательОС", Пользователь.ПользовательОС); 
	ПараметрыВхода.Вставить("Пароль", Пароль); 
		
	Возврат ОбменСервер.Идентификация(ПараметрыВхода);
	
КонецФункции

&НаКлиенте
Функция РеквизитыФормыЗаполненыКорректно()
	
	Если ЭтотОбъект.Логин = ЭтотОбъект.СлужебныйПользователь Тогда
		Возврат Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Логин)  Тогда
		ТекстПредупреждения = НСтр("ru = 'Форма заполнена некорректно. Заполните поле ""Логин""';");
		ПоказатьПредупреждение( , ТекстПредупреждения, 4);
		Возврат Ложь;
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект.Логин) Тогда
			УстановитьТекущегоПользователя(ЭтотОбъект.Логин);
		Иначе
			ТекстПредупреждения 
				= СтрШаблон(НСтр("ru = 'Пользователь с логином %1 не найден в базе.';"), ЭтотОбъект.Логин);
			ПоказатьПредупреждение( , ТекстПредупреждения, 4);
			Возврат Ложь;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ГруппаСкладовОбменаДанными) Тогда
			ТекстПредупреждения = НСтр("ru = 'Форма заполнена некорректно. Заполните поле ""Склад""';");
			ПоказатьПредупреждение( , ТекстПредупреждения, 4);
			Возврат Ложь;
		Иначе
			УстановитьСклад(ЭтотОбъект.ГруппаСкладовОбменаДанными);
		КонецЕсли;
		
		Возврат Истина;

	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПользователиВБазе()
	
	Возврат Справочники.Пользователи.ЕстьПользователиВБазе();
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьТекущегоПользователя(Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ТекущийПользователь.Установить(Пользователь);
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "Организация,Подразделение");
	Константы.ОрганизацияПользователя.Установить(РеквизитыПользователя.Организация);
	Константы.ПодразделениеПользователя.Установить(РеквизитыПользователя.Подразделение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСклад(Склад)
	
	Константы.ГруппаСкладовОбменаДанными.Установить(Склад);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РолиПользователяИзСправочника(Знач Логин)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователиРоли.Роль КАК Роль
	|ИЗ
	|	Справочник.Пользователи.Роли КАК ПользователиРоли
	|ГДЕ
	|	ПользователиРоли.Ссылка = &Логин
	|	И НЕ ПользователиРоли.Роль = """"";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Роль");

КонецФункции
	
&НаСервереБезКонтекста
Функция ИмяПользователяОС(Знач Логин)

	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	ЛогинОС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Логин, "ПользовательОС");
	Если ПустаяСтрока(ЛогинОС) Тогда
		Возврат Неопределено;
	Иначе
		ЛогинОС = СтрЗаменить(ЛогинОС, "\\mechel\", "");
		ЛогинОС = СтрЗаменить(ЛогинОС, "\\MECHEL\", "");
	КонецЕсли;
	
	ПользовательМП = ПользователиИнформационнойБазы.НайтиПоИмени(ЛогинОС);

	Если ТекПользователь <> ЛогинОС Тогда
		ОбщегоНазначенияВызовСервера.ОчиститьПользователейИнфБазы(Истина);
	КонецЕсли;
	Если ПользовательМП = Неопределено Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = ЛогинОС;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.мп_ОбщиеПрава);
		НовыйПользователь.Записать();
		ПользовательМП = ПользователиИнформационнойБазы.НайтиПоИмени(ЛогинОС);
	КонецЕсли;
	Если ТекПользователь <> ЛогинОС Тогда
		ПользовательМП.Роли.Очистить();
	КонецЕсли;

	Если Не ПользовательМП.Роли.Содержит(Метаданные.Роли.мп_ОбщиеПрава) Тогда
		ПользовательМП.Роли.Добавить(Метаданные.Роли.мп_ОбщиеПрава);
	КонецЕсли;

	РолиИзСправочника = РолиПользователяИзСправочника(Логин);

	РолиКонфигуратора = Новый Массив;
	Для Каждого ТекРоль Из ПользовательМП.Роли Цикл
		Если ТекРоль.Имя = "мп_ОбщиеПрава" Тогда
			Продолжить;
		КонецЕсли;

		РолиКонфигуратора.Добавить(ТекРоль.Имя);
	КонецЦикла;

	ЛогинСтруктура = Новый Структура;
	ЛогинСтруктура.Вставить("ЛогинОС", ЛогинОС);
	ЛогинСтруктура.Вставить("ДанныеСовпадают", Ложь);
	Если Логин.ПометкаУдаления Или Логин.Недействителен Тогда
		НетПравИспользования = Истина;
	Иначе
		НетПравИспользования = Ложь;
	КонецЕсли;
	ЛогинСтруктура.Вставить("НетПравИспользования", НетПравИспользования);
	Если ОбщегоНазначения.ДанныеСовпадают(РолиИзСправочника, РолиКонфигуратора) Тогда
		ЛогинСтруктура.ДанныеСовпадают = Истина;
	Иначе 
		ЛогинСтруктура.ДанныеСовпадают = Ложь;
		// добавить роли
		Для Каждого ТекРоль Из РолиИзСправочника Цикл
			Если ТекРоль = "ОбъектXDTO" Тогда
				Продолжить;
			КонецЕсли;
			Если РолиКонфигуратора.Найти(ТекРоль) = Неопределено Тогда
				ПользовательМП.Роли.Добавить(Метаданные.Роли[ТекРоль]);
			КонецЕсли;
		КонецЦикла;

		// удалить лишние роли из конфигуратора
		УдаляемыеРоли = Новый Массив;
		Для Каждого ТекРоль Из РолиКонфигуратора Цикл
			Если РолиИзСправочника.Найти(ТекРоль) = Неопределено Тогда
				УдаляемыеРоли.Добавить(Метаданные.Роли[ТекРоль]);
			КонецЕсли;
		КонецЦикла;

		Для Каждого ТекРоль Из УдаляемыеРоли Цикл
			ПользовательМП.Роли.Удалить(ТекРоль);
		КонецЦикла;

		Если Логин.Служебный Тогда
			Если Не ПользовательМП.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
				ПользовательМП.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
			КонецЕсли;
		КонецЕсли;

		ПользовательМП.Записать();
	КонецЕсли;

	Возврат ЛогинСтруктура;

КонецФункции

#КонецОбласти
